"{'name': 'partition_pdf', 'api_name': 'partition_pdf', 'description': 'Parses a pdf document into a list of interpreted elements.', 'parameters': {'required': [{'name': 'filename', 'description': 'A string defining the target filename path.'}, {'name': 'file', 'description': 'A file-like object as bytes --> open(filename, \"rb\").'}], 'optional': [{'name': 'include_page_breaks', 'description': 'A boolean indicating whether to include page breaks in the partition.'}, {'name': 'strategy', 'description': 'The strategy to use for partitioning the PDF. Valid strategies are \"hi_res\",\\n\"ocr_only\", and \"fast\". When using the \"hi_res\" strategy, the function uses\\na layout detection model to identify document elements. When using the\\n\"ocr_only\" strategy, partition_pdf simply extracts the text from the\\ndocument using OCR and processes it. If the \"fast\" strategy is used, the text\\nis extracted directly from the PDF. The default strategy `auto` will determine\\nwhen a page can be extracted using `fast` mode, otherwise it will fall back to `hi_res`.'}, {'name': 'infer_table_structure', 'description': 'Only applicable if `strategy=hi_res`.\\nIf True, any Table elements that are extracted will also have a metadata field\\nnamed \"text_as_html\" where the table\\'s text content is rendered into an html string.\\nI.e., rows and cells are preserved.\\nWhether True or False, the \"text\" field is always present in any Table element\\nand is the text content of the table (no structure).'}, {'name': 'ocr_languages', 'description': \"The languages to use for the Tesseract agent. To use a language, you'll first need\\nto isntall the appropriate Tesseract language pack.\"}, {'name': 'max_partition', 'description': 'The maximum number of characters to include in a partition. If None is passed,\\nno maximum is applied. Only applies to the \"ocr_only\" strategy.'}, {'name': 'include_metadata', 'description': 'A boolean indicating whether to include metadata in the partition.'}, {'name': 'metadata_filename', 'description': 'A string defining the metadata filename path.'}]}}"